# python 3.7

# 에피소드가 종료되는 조건
# 막대기 각도 : -12도 ~ +12도
# 카트의 위치 : -2.4 ~ +2.4
# 시간 > 200

import gym

env = gym.make('CartPole-v0')

# 20번의 에피소드를 진행
for i_episode in range(20):
  observation = env.reset()

  # 각 에피소드마다 100시간을 진행
  for t in range(100):

      env.render()
      print(observation)
      action = env.action_space.sample()
      observation, reward, done, info = env.step(action)

      if done:
          print('Episode finished after {} timesteps'.format(t+1))
          break

env.close()

# 결과
# [ 0.02180032 -0.04335631  0.03196771  0.03386761]
# [ 0.02093319 -0.23892175  0.03264506  0.3364628 ]
# [ 0.01615476 -0.04427921  0.03937431  0.0542505 ]
# [ 0.01526917 -0.23994297  0.04045932  0.3590917 ]
# [ 0.01047031 -0.04541883  0.04764116  0.07943609]
# [ 0.00956194 -0.24119021  0.04922988  0.38676116]
# [ 0.00473813 -0.43697518  0.0569651   0.6945506 ]
# [-0.00400137 -0.6328391   0.07085612  1.0046085 ]
# [-0.01665815 -0.8288322   0.09094828  1.3186748 ]
# [-0.0332348  -1.0249789   0.11732178  1.6383808 ]
# [-0.05373437 -0.8314116   0.1500894   1.3844393 ]
# [-0.07036261 -1.0280526   0.17777818  1.7200456 ]
# Episode finished after 12 timesteps
